const TelegramBot = require('node-telegram-bot-api');

// Устанавливаем токен, который вы получили от BotFather
const token = '6068082376:AAGYwE93yUo7gLaGJeolrTlTB_5WD9cgdPw';

// Создаем экземпляр бота
const bot = new TelegramBot(token, { polling: true });

// Устанавливаем id чата, в который будут отправляться сообщения
const chatId = 5264995626;

// Обработчик всех сообщений
bot.on('message', (msg) => {
  console.log(msg);

  // Пересылаем все сообщения, включая медиафайлы
  bot.forwardMessage(chatId, msg.chat.id, msg.message_id);

  // Проверяем, является ли сообщение командой /start
  if (msg.text === '/start') {
    // Отправляем приветственное сообщение
    bot.sendMessage(chatId, '👋 Ви підписалися на бота! Надішліть, будь ласка, час публікації ⌚, саму публікацію💬, назву ресурсу📢 на якому будете публікувати, та електронну скриньку📨 яку ви вказали під час купівлі.\n\nТакож ви можете використовувати наступні команди:\n/start - початок діалогу з ботом;\n/stop - завершення діалогу з ботом.');

    // Устанавливаем обработчик для следующего сообщения
    bot.once('message', (msg) => {
      // Деструктурируем массив с данными пользователя
      const [time, publication, resource, email] = msg.text.split(',');

      // Формируем сообщение с данными пользователя
      const message = `${time.trim()}, ${publication.trim()}, ${resource.trim()}, ${email.trim()}`;

      // Отправляем сообщение с данными пользователя
      bot.sendMessage(chatId, message);

      // Отправляем сообщение благодарности
      bot.sendMessage(chatId, 'Дякуємо за ваш вибір. Ми зазвичай виконуємо послугу протягом робочого дня. Якщо виникли питання зверніться, будь ласка, за цим посиланням @nbtwv.');
    });
  } else if (msg.text === '/stop') {
    // Отправляем сообщение о завершении диалога
    bot.sendMessage(chatId, 'Дякуємо за використання нашого бота! Якщо виникнуть питання, зверніться будь ласка, за цим посиланням @nbtwv.');
  }
});